app/Controllers/Auth.php

SELECT *
FROM `admin`
WHERE `email` = 'awikwok@gmail.com'
 LIMIT 1
---
    public function process()
    {
        $session = session();
        $model = new \App\Models\AdminModel();

        // Tangkap data dari form
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');

        // Cari admin berdasarkan email
        $data = $model->where('email', $email)->first();

INSERT INTO `admin` (`email`, `password`, `nama_lengkap`) VALUES ('admin@perpus.com', '$2y$12$/38HTuQ2jp9vL.bdbXSz2u8QptC44wk8MpFMcgAfFu.vNRqym.Yxm', 'Super Admin')
---
    public function buatAdmin()
    {
        $model = new \App\Models\AdminModel();

        $data = [
            'email'        => 'admin@perpus.com',
            // Ini kunci rahasianya: kita biarkan sistem yang meracik hash aslinya
            'password'     => password_hash('admin123', PASSWORD_BCRYPT),
            'nama_lengkap' => 'Super Admin'
        ];

        $model->insert($data);